{"meta":{"title":"Weilan's Blog","subtitle":"腹有诗书气自华","description":"","author":"Weilan Yu","url":"https://weilanyu.herokuapp.com/blog","root":"/blog/"},"pages":[{"title":"categories","date":"2020-09-06T23:00:00.000Z","updated":"2020-09-06T23:04:36.391Z","comments":false,"path":"categories/index.html","permalink":"https://weilanyu.herokuapp.com/blog/categories/index.html","excerpt":"","text":""},{"title":"archives","date":"2020-09-06T23:04:02.000Z","updated":"2020-09-06T23:05:06.179Z","comments":true,"path":"archives/index.html","permalink":"https://weilanyu.herokuapp.com/blog/archives/index.html","excerpt":"","text":""},{"title":"tags","date":"2020-09-06T23:05:30.000Z","updated":"2020-09-06T23:05:50.940Z","comments":true,"path":"tags/index.html","permalink":"https://weilanyu.herokuapp.com/blog/tags/index.html","excerpt":"","text":""}],"posts":[{"title":"How to Integrate Hexo Into An Exisiting App","slug":"How-to-Integrate-Hexo-Into-An-Exisiting-App","date":"2020-09-07T01:03:10.000Z","updated":"2020-09-07T03:14:04.041Z","comments":true,"path":"2020/09/06/How-to-Integrate-Hexo-Into-An-Exisiting-App/","link":"","permalink":"https://weilanyu.herokuapp.com/blog/2020/09/06/How-to-Integrate-Hexo-Into-An-Exisiting-App/","excerpt":"This is my first post. I spent a day on figuring out how to add a blog module into my portfolio and deploy it to heroku. And ta da, I did it as you are reading this post.","text":"This is my first post. I spent a day on figuring out how to add a blog module into my portfolio and deploy it to heroku. And ta da, I did it as you are reading this post. Hexo is an open-source framework built upon nodejs, and it has lots of themes avaiable to download. I found a bunch of tutorial on how to deploy it to GitHub, but rarely found one to teach you how to work with your current application. In this post, I am going to show you how to add Hexo into your nodejs app, change a theme, and deploy it to heroku. Quick StartI don’t want to overload my nodejs app’s public folder, so I create a new folder called hexo underneath the root of my application. Look like this Install Hexo in the newly created folder hexo by running the command $ npm install -g hexo-cli Configure Routes Inside app.js, add the following app.use(&#39;/blog&#39;, express.static(path.join(__dirname, &#39;hexo/public&#39;))); The path that you provide to the express.static function is relative to the directory from where you launch your node process. If you run the express app from another directory, it’s safer to use the absolute path of the directory that you want to serve. By adding this line, I am telling the express app that uses resources in hexo/public to satisfy the requests whenever the route is /blog. And other routes will continue using the static files from /public. Run the BlogCreate a public folder for the first time running. Render the markdown file in source/_post into html and copy them to public. It would simply copy the original file to public if it’s other format. $ hexo g Run the application $ npm start To serialize two commands, change the start command in package.json from &quot;scripts&quot;: &#123; &quot;start&quot;: &quot;node ./bin/www&quot; &#125; To &quot;scripts&quot;: &#123; &quot;start&quot;: &quot;(cd hexo &amp;&amp; hexo generate) &amp; node ./bin/www&quot; &#125; Change ThemeThe Hexo’s default theme is landscape. It’s clean and simple, but not my style. I love exploring new stuffes and immerse myself into beautiful design. Just find your favorite theme, and add it as subproject in hexo/themes by running $ git submodule add theme-url-in-github The theme will be cloned to current directory. To read more about submodule, please refers to the documentation Git Tools - Submodules Change the theme. Go to /hexo/_config.yaml, change the theme to package name in your themes folder. You can customize the theme. The documentation for each theme maintained by the author is well-written and will give you guidance. Local deployment should work. Deploy to Heroku Generate the static files in hexo first. This step is really important. Otherwise, hexo/public is not able to locate. Remove public in .gitigonre to allow public folder being pushed to GitHub Push to GitHub. Done!","categories":[],"tags":[{"name":"tech","slug":"tech","permalink":"https://weilanyu.herokuapp.com/blog/tags/tech/"}]},{"title":"Hello World","slug":"hello-world","date":"2020-09-06T19:00:41.255Z","updated":"2020-09-06T23:19:44.770Z","comments":true,"path":"2020/09/06/hello-world/","link":"","permalink":"https://weilanyu.herokuapp.com/blog/2020/09/06/hello-world/","excerpt":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post$ hexo new &quot;My New Post&quot;","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post$ hexo new &quot;My New Post&quot; More info: Writing Run server$ hexo server More info: Server Generate static files$ hexo generate More info: Generating Deploy to remote sites$ hexo deploy More info: Deployment","categories":[{"name":"miscellaneous","slug":"miscellaneous","permalink":"https://weilanyu.herokuapp.com/blog/categories/miscellaneous/"}],"tags":[]}],"categories":[{"name":"miscellaneous","slug":"miscellaneous","permalink":"https://weilanyu.herokuapp.com/blog/categories/miscellaneous/"}],"tags":[{"name":"tech","slug":"tech","permalink":"https://weilanyu.herokuapp.com/blog/tags/tech/"}]}